logs/Google_cloud/select_random_ranges.log
sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            58752
        write:                           0
        other:                           0
        total:                           58752
    transactions:                        58752  (5851.74 per sec.)
    queries:                             58752  (5851.74 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0381s
    total number of events:              58752

Latency (ms):
         min:                                  0.42
         avg:                                  1.36
         max:                                 43.29
         95th percentile:                      2.30
         sum:                              79925.75

Threads fairness:
    events (avg/stddev):           7344.0000/1524.81
    execution time (avg/stddev):   9.9907/0.01

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            63400
        write:                           0
        other:                           0
        total:                           63400
    transactions:                        63400  (6335.31 per sec.)
    queries:                             63400  (6335.31 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0054s
    total number of events:              63400

Latency (ms):
         min:                                  0.43
         avg:                                  2.52
         max:                                 48.99
         95th percentile:                      4.25
         sum:                             159883.59

Threads fairness:
    events (avg/stddev):           3962.5000/817.37
    execution time (avg/stddev):   9.9927/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            61392
        write:                           0
        other:                           0
        total:                           61392
    transactions:                        61392  (6131.93 per sec.)
    queries:                             61392  (6131.93 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0099s
    total number of events:              61392

Latency (ms):
         min:                                  0.39
         avg:                                  5.21
         max:                                215.01
         95th percentile:                      8.90
         sum:                             319923.78

Threads fairness:
    events (avg/stddev):           1918.5000/356.48
    execution time (avg/stddev):   9.9976/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            51853
        write:                           0
        other:                           0
        total:                           51853
    transactions:                        51853  (5172.28 per sec.)
    queries:                             51853  (5172.28 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0232s
    total number of events:              51853

Latency (ms):
         min:                                  0.41
         avg:                                 12.35
         max:                                218.64
         95th percentile:                     19.65
         sum:                             640353.46

Threads fairness:
    events (avg/stddev):           810.2031/128.08
    execution time (avg/stddev):   10.0055/0.01

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            60636
        write:                           0
        other:                           0
        total:                           60636
    transactions:                        60636  (6038.46 per sec.)
    queries:                             60636  (6038.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0397s
    total number of events:              60636

Latency (ms):
         min:                                  0.47
         avg:                                 21.14
         max:                               1071.03
         95th percentile:                     32.53
         sum:                            1281794.20

Threads fairness:
    events (avg/stddev):           473.7188/77.71
    execution time (avg/stddev):   10.0140/0.01

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 256
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            52911
        write:                           0
        other:                           0
        total:                           52911
    transactions:                        52911  (5240.84 per sec.)
    queries:                             52911  (5240.84 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0938s
    total number of events:              52911

Latency (ms):
         min:                                  0.68
         avg:                                 48.57
         max:                               2167.96
         95th percentile:                     77.19
         sum:                            2570006.85

Threads fairness:
    events (avg/stddev):           206.6836/32.39
    execution time (avg/stddev):   10.0391/0.03

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 512
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            58053
        write:                           0
        other:                           0
        total:                           58053
    transactions:                        58053  (5704.58 per sec.)
    queries:                             58053  (5704.58 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.1744s
    total number of events:              58053

Latency (ms):
         min:                                  0.47
         avg:                                 88.75
         max:                               3087.34
         95th percentile:                    134.90
         sum:                            5152237.83

Threads fairness:
    events (avg/stddev):           113.3848/16.98
    execution time (avg/stddev):   10.0630/0.05